// ПАМ'ЯТКА ПО ООП

// знайти сутність з чим роботи, юзер, корзина.
// // модулі з якими я повинен розбити свій код
// // ОПП - абстракція - створення моделі(приклад програми з чим я буду працювати) - залишаю тільки головні параметри =>
// // (стануть властивостями, закладуємо основи методів)
// //
// //вхід в кабінет
// // модель  ""user"" (username, pasword, email) => можна далі створювати об'єкт(модель)
// // при вході в кабінет є можливість увійти і вийти
// // сворюємо методи (logIn(), logOut(), regestration())
// //         ^
// //         |
// // З чого варто почати
